channel/system/blockMeshDict
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

FoamFile
{
		version			2.0;
		format			ascii;
		class				dictionary;
		object			blockMeshDict;
}

// ***************************************************************************** //

scale				1;

vertices
(
		( 0	-0.5	-0.5 ) // 0
		( 2.5	-0.5	-0.5 ) // 1
		( 2.5	0.5	-0.5 ) // 2
		( 0	0.5	-0.5 ) // 3
		( 0	-0.5	0.5 ) // 4
		( 2.5	-0.5	0.5 ) // 5
		( 2.5	0.5	0.5 ) // 6
		( 0	0.5	0.5 ) // 7
);

blocks
(
		hex (0 1 2 3 4 5 6 7) (100 40 40) simpleGrading (1 ((.5 .5 8) (.5 .5 0.125)) ((.5 .5 8) (.5 .5 0.125)))
);

boundary
(
		inlet
		{
				type patch;
				faces ((0 4 7 3));
		}
		outlet
		{
				type patch;
				faces ((1 5 6 2));
		}
		left
		{
				type wall;
				faces ((0 1 2 3));
		}
		down
		{
				type wall;
				faces ((0 4 5 1));
		}
		right
		{
				type wall;
				faces ((4 5 6 7));
		}
		up
		{
				type wall;
				faces ((7 6 2 3));
		}
);

