channel/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          1600;
        startFace       470400;
    }
    outlet
    {
        type            patch;
        nFaces          1600;
        startFace       472000;
    }
    left
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4000;
        startFace       473600;
    }
    down
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4000;
        startFace       477600;
    }
    right
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4000;
        startFace       481600;
    }
    up
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4000;
        startFace       485600;
    }
)

// ************************************************************************* //
