channel/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField uniform (10 0 0);

boundaryField
{
    "(up|down|left|right)"
    {
        type            noSlip;
    }

    inlet
    {
        type                turbulentInlet;
        fluctuationScale    (0.1 0.1 0.1);
        referenceField      $internalField;
        alpha               0.1;
    }

    outlet
    {
        type            advective;
        value           $internalField;
    }

}


// ************************************************************************* //
